Repository: lrusak/visualization.matrix
Catalog: visualization.matrix/resources/language/resource.language.*/strings.po
Languages: fi_fi, ru_ru

# Addon Summary
source: Matrix inspired visualization for Kodi.
fi_fi: Matrix-elokuvan inspiroima Kodi-visualisointi.
ru_ru: Визуализация для Kodi, вдохновлённая Матрицей.

# Addon Description
source: This music visualization is inspired by the movie "Matrix". It features eight presets.
fi_fi: Äänivisualisointi, joka on "The Matrix" -elokuvan inspiroima. Se sisältää kahdeksan esiasetusta.
ru_ru: Эта визуализация для аудиоплеера вдохновлена фильмом "Матрица". Она включает восемь предустановок.

# #30000
source: General
fi_fi: Yleiset
ru_ru: Общие

# #30001
source: Pixel size
fi_fi: Pikselikoko
ru_ru: Размер пикселей

# #30002
source: Size of a "pixel" which forms the rain.
fi_fi: Määrittää sateen muodostavien "pikseleiden" koon.
ru_ru: Размер "пикселей", которые формируют дождь.

# #30003
source: Rain fall speed
fi_fi: Sateen putoamisnopeus
ru_ru: Скорость капель дождя

# #30004
source: The speed how fast the rain is falling.
fi_fi: Määrittää sateen putoamisnopeuden.
ru_ru: Скорость, которая определяет, как быстро капли проходят заданный путь.

# #30005
source: Noise fluctuation
fi_fi: Kohinan vaihtelu
ru_ru: Изменчивость шума

# #30006
source: The speed how fast the noise is changing.
fi_fi: Määrittää kohinan vaihtelunopeuden.
ru_ru: Скорость, определяющая быстроту изменений, происходящих с шумом.

# #30007
source: Distort threshold
fi_fi: Säröytymiskynnys
ru_ru: Порог искажений

# #30008
source: Threshold of loudness at which vertical distortion occurs.
fi_fi: Äänenvoimakkuuden kynnysarvo, jossa tapahtuu vaakasuuntaista säryötymistä.
ru_ru: Порог громкости, начиная с которой вертикальные искажения начнут появляться.

# #30009
source: User defined pixel size
fi_fi: Käyttäjän määrittämä pikselikoko
ru_ru: Использовать предустановленный размер пикселей

# #30010
source: Enables the manual setting of the size of the dots.
fi_fi: Kytkee manuaalisen pistekoon määrityksen käyttöön.
ru_ru: Включить ручную настройку размера точек.

# #30011
source: Strength of rain highlights
fi_fi: Sateen korostusvoimakkuus
ru_ru: Сила освещённых участков дождя

# #30012
source: Sets the colour intensity of individual raindrops at music peaks.
fi_fi: Määrittää yksittäisten sadepisaroiden värin voimakkuuden äänen huipuilla.
ru_ru: Устанавливает интенсивность цвета каждой капли во время скачков громкости.

# #30050
source: Red
fi_fi: Punainen
ru_ru: Красный

# #30051
source: Green
fi_fi: Vihreä
ru_ru: Зелёный

# #30052
source: Blue
fi_fi: Sininen
ru_ru: Синий

# #30053
source: The color of the "pixels".
fi_fi: "Pikseleiden" väri.
ru_ru: Цвет "пикселей".

# #30060
source: Enable performance optimizations
fi_fi: Käytä suorituskykyoptimointeja
ru_ru: Включить оптимизации производительности

# #30061
source: Lowers the quality of some shader calculations in order to boost performance (FPS) on slower systems.
fi_fi: Laskee joidenkin varjostimien laskentalaatua suorituskyvyn (kuvanopeuden) parantamiseksi hitaissa laitteistoissa.
ru_ru: Снизить точность расчёта некоторого числа пикселей, чтобы улучшить производительность (FPS) на медленных системах.

# #30062
source: CRT effect
fi_fi: CRT-tehoste
ru_ru: ЭЛП эффект

# #30063
source: Adds a CRT-like distortion effect.
fi_fi: Lisää CRT-tyylisen häiriötehosteen.
ru_ru: Добавляет эффект искажения, похожий на работу ЭЛТ.

# #30101
source: Album
fi_fi: Albumi
ru_ru: Альбом

# #30102
source: Rain only
fi_fi: Vain sade
ru_ru: Только дождь

# #30103
source: Rain with waveform
fi_fi: Sade ja aaltomuotograafi
ru_ru: Дождь с формой музыкальной волны

# #30104
source: Rain with waveform envelope
fi_fi: Sade ja aaltomuotograafikuori
ru_ru: Дождь с огибающей форму музыкальной волны

# #30105
source: Clean rain
fi_fi: Puhdas sade
ru_ru: Простой дождь

# #30106
source: Clean rain with waveform
fi_fi: Puhdas sade ja aaltomuotograafi
ru_ru: Простой дождь с формой музыкальной волны

# #30107
source: Clean rain with waveform envelope
fi_fi: Puhdas sade ja aaltomuotograafikuori
ru_ru: Простой дождь с огибающей форму музыкальной волны
